In [1]:
datafile = "titanicdata.htm"

In [7]:
from bs4 import BeautifulSoup
with open(datafile,encoding="ISO-8859-1") as f:
    soup = BeautifulSoup(f, "html.parser")

In [8]:
table = soup.find('table')

In [9]:
import pandas as pd
data = pd.read_html(str(table), flavor='bs4')[0]

In [10]:
data.head()

,Name,Age,Class/Dept,Ticket,Joined,Job,Boat [Body],Unnamed: 7
0,"ABÄ«-AL-MUNÃ , Mr NÄsÄ«f QÄsim",27,3rd Class Passenger,2699£18 15s 9d,Cherbourg,NaN,15,NaN
1,"ABBING, Mr Anthony",42,3rd Class Passenger,5547£7 11s,Southampton,Blacksmith,NaN,NaN
2,"ABBOTT, Mrs Rhoda Mary 'Rosa'",39,3rd Class Passenger,CA2673£20 5s,Southampton,NaN,A,NaN
3,"ABBOTT, Mr Rossmore Edward",16,3rd Class Passenger,CA2673£20 5s,Southampton,Jeweller,[190],NaN
4,"ABBOTT, Mr Eugene Joseph",13,3rd Class Passenger,CA2673£20 5s,Southampton,Scholar,NaN,NaN

In [33]:
def cleanup(value):
    value = value.encode('utf8')
    return value.decode('utf8',errors='replace').replace("?","")

In [38]:
data['Name'] = data['Name'].apply(cleanup)
#data['Boat [Body]'] = data['Boat [Body]'].apply(cleanup)
data['Age'] = data['Age'].apply(pd.to_numeric, errors='coerce')
data = data[['Name','Age','Class/Dept','Boat [Body]']]

In [39]:
data.head()

                               Name   Age           Class/Dept Boat [Body]
0  AB��-AL-MUN��, Mr N��s��f Q��sim  27.0  3rd Class Passenger          15
1                ABBING, Mr Anthony  42.0  3rd Class Passenger         NaN
2     ABBOTT, Mrs Rhoda Mary 'Rosa'  39.0  3rd Class Passenger           A
3        ABBOTT, Mr Rossmore Edward  16.0  3rd Class Passenger       [190]
4          ABBOTT, Mr Eugene Joseph  13.0  3rd Class Passenger         NaN